benchmarks/2023-Oct-02_142431/go-chi.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        92 bytes

Concurrency Level:      100
Time taken for tests:   0.525 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2000000 bytes
Total body sent:        2510000
HTML transferred:       920000 bytes
Requests per second:    19044.25 [#/sec] (mean)
Time per request:       5.251 [ms] (mean)
Time per request:       0.053 [ms] (mean, across all concurrent requests)
Transfer rate:          3719.58 [Kbytes/sec] received
                        4668.07 kb/s sent
                        8387.65 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.5      2       4
Processing:     1    3   3.0      3      33
Waiting:        0    2   3.0      2      33
Total:          2    5   2.9      5      34

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      5
  90%      6
  95%      6
  98%      7
  99%     33
 100%     34 (longest request)