benchmarks/2023-Oct-02_142431/javascript-node.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        91 bytes

Concurrency Level:      100
Time taken for tests:   2.205 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2980000 bytes
Total body sent:        2510000
HTML transferred:       910000 bytes
Requests per second:    4535.86 [#/sec] (mean)
Time per request:       22.047 [ms] (mean)
Time per request:       0.220 [ms] (mean, across all concurrent requests)
Transfer rate:          1320.01 [Kbytes/sec] received
                        1111.82 kb/s sent
                        2431.82 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     5   22   3.9     20      40
Waiting:        1   22   3.9     20      40
Total:          7   22   3.9     20      41

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     21
  75%     22
  80%     23
  90%     29
  95%     30
  98%     34
  99%     35
 100%     41 (longest request)