benchmarks/2023-Oct-02_142431/python-flask.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        gunicorn
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        92 bytes

Concurrency Level:      100
Time taken for tests:   2.418 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2370000 bytes
Total body sent:        2510000
HTML transferred:       920000 bytes
Requests per second:    4136.11 [#/sec] (mean)
Time per request:       24.177 [ms] (mean)
Time per request:       0.242 [ms] (mean, across all concurrent requests)
Transfer rate:          957.28 [Kbytes/sec] received
                        1013.83 kb/s sent
                        1971.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     1   24   1.7     24      30
Waiting:        1   24   1.7     24      30
Total:          3   24   1.5     24      30

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     25
  75%     25
  80%     25
  90%     25
  95%     25
  98%     25
  99%     30
 100%     30 (longest request)