benchmarks/2023-Oct-02_142431/rust-axum.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        91 bytes

Concurrency Level:      100
Time taken for tests:   0.541 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1990000 bytes
Total body sent:        2510000
HTML transferred:       910000 bytes
Requests per second:    18487.88 [#/sec] (mean)
Time per request:       5.409 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          3592.86 [Kbytes/sec] received
                        4531.70 kb/s sent
                        8124.56 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.4      2       4
Processing:     1    3   2.6      3      30
Waiting:        1    3   2.6      2      30
Total:          2    5   2.5      5      31

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      6
  90%      6
  95%      6
  98%      6
  99%     29
 100%     31 (longest request)